{
  "title": "DOAG VOICES DevLand – mit Dave König, Vanessa Schmitz und Markus Bernhart",
  "pubDate": "2026-02-10T07:00:00.000Z",
  "pubDateFormatted": "10. Februar 2026",
  "description": "Low-Code und No-Code sind l&#228;ngst kein Nischenthema mehr. In dieser DOAG-VOICES-Folge sprechen Dave K&#246;nig, Markus Bernhart und Vanessa Schmitz dar&#252;ber, wie sich Softwareentwicklung aktuell neu erfindet – zwischen klassischen Pro-Code-Stacks, Citizen Developern, Plattformdenken und dem wachsenden Einfluss von KI.Markus Bernhart erkl&#228;rt, warum Low-Code nicht als Ersatz, sondern als Erweiterung moderner Softwareentwicklung verstanden werden muss. Plattformen wie Mendix, OutSystems, Camunda oder Oracle APEX zeigen, dass deklarative und konfigurationsbasierte Ans&#228;tze heute produktionsreif sind – auch im Enterprise- und Beh&#246;rdenumfeld. Gleichzeitig wird deutlich: Governance, Security und klare Rollenmodelle bleiben unverzichtbar.Vanessa Schmitz gibt Einblicke in die Arbeit der Low-Code-Association und erl&#228;utert, warum gerade &#246;ffentliche Verwaltung, Mittelstand und Enterprise-IT von strukturiertem Low-Code-Einsatz profitieren k&#246;nnen. Ziel ist nicht Schatten-IT, sondern kontrollierte, skalierbare Entwicklung mit klaren Leitplanken.Ein zentrales Thema ist das Zusammenspiel von Low-Code und KI. Vibe-Coding, Prompt-basierte Entwicklung und agentische Systeme er&#246;ffnen neue M&#246;glichkeiten, werfen aber auch Fragen nach Wartbarkeit, Versionierung und Enterprise-Tauglichkeit auf. Die Diskussion zeigt: KI wird Low-Code nicht ersetzen, sondern verst&#228;rken.Abgerundet wird die Folge durch das Spiel „Tech- oder Myth-Facts?“, pers&#246;nliche Einblicke und einen Blick auf die Zukunft der Softwareentwicklung zwischen Plattformen, Automatisierung und neuen Entwicklerrollen.–––Kapitel&#252;bersicht:00:00 • IntroWillkommen bei DOAG VOICES DevLand00:30 • Vorstellung der G&#228;steMarkus Bernhart und Vanessa Schmitz &#252;ber ihre Rollen und Hintergr&#252;nde.03:19 • Was bedeutet Low-Code heute?Definitionen, Marktbewegungen und warum Abgrenzung immer schwieriger wird.09:56 • Citizen Developer & neue RollenbilderZwischen Fachbereich, IT und professioneller Entwicklung.15:34 • Governance, Security & PlattformdenkenWarum Low-Code klare Regeln braucht – und sie liefern kann.22:24 • Tech- oder Myth-Facts?Skurrile Tech-Geschichten zwischen Wahrheit und Legende.26:44 • Low-Code trifft KI & Vibe-CodingChancen, Grenzen und reale Enterprise-Erfahrungen.35:04 • Die Low-Code-AssociationZiele, Community-Arbeit und warum Vernetzung entscheidend ist.43:40 • Outro–––Die Top 3 Learnings dieser Episode:1. Low-Code ist keine Abk&#252;rzung, sondern eine moderne Form von Softwareengineering.2. Citizen Developer brauchen Governance – Plattformen liefern daf&#252;r die Basis.3. KI und Vibe-Coding entfalten ihren Mehrwert erst in Kombination mit Low-Code-Ans&#228;tzen.–––Mehr &#252;ber Markus Bernhart:https://www.linkedin.com/in/bernhart/–––Mehr &#252;ber Vanessa Schmitz:https://www.linkedin.com/in/vanessa-schmitz-1b1bb3a2/–––Mehr &#252;ber Dave K&#246;nig aka Frickeldave:https://frickeldave.de–––Mehr &#252;ber die DOAG:https://www.doag.org–––Anstehende DOAG-Konferenzen:DevLand 2026 | 12. & 13. M&#228;rz | Europa-Park Rusthttps://www.devland.eu/de/APEX connect 2026 | 18. - 20. Mai | Heide Park Soltauhttps://apex.doag.org/de/home/DOAG 2026 Datenbank mit Cloud Infrastructure | 18. - 19. Mai | Heide Park Soltauhttps://datenbank.doag.org/de/home/CloudLand 2026 | 19. - 22. Mai | Heide Park Soltauhttps://www.cloudland.org/de/home/–––Das Gespr&#228;ch entstand w&#228;hrend der gro&#223;en Konferenzwoche der DOAG – mit vier Events vom 17. bis 21. November 2025 – im N&#252;rnberger Kongresszentrum. S&#228;mtliche Sessions der dort Vortragenden sind nachtr&#228;glich mit einem entsprechenden On-demand-Ticket zum jeweiligen Event nachtr&#228;glich aufrufbar.---Das im Podcast besprochen Buch der Low-Code Association \"Paradigmenwechsel Low-Code: Softwareentwicklung (fast) ohne Programmierung (KI – Best Practice in Industrie, Dienstleistung und Verwaltung)\" (herausgegeben 2025) ist &#252;ber den Buchhandel und bei vielen Online-Portalen erh&#228;ltlich, z.B. Amazon: https://amzn.eu/d/09XaTmLY Hosted on Acast. See acast.com/privacy for more information.",
  "audioUrl": "https://sphinx.acast.com/p/open/s/68e81ee2de9a2a62c462d72f/e/698ad77af6349d3c6e6557f1/media.mp3",
  "link": "https://shows.acast.com/doag-voices-arbeitstitel/episodes/698ad77af6349d3c6e6557f1",
  "guid": "698ad77af6349d3c6e6557f1"
}