{
  "news": [
    {
      "visible": true,
      "date": "2026-01-31",
      "title": "website release",
      "text": "Nach 6 Monaten arbeit ist die Website nun fertig und unter frickeldave.de erreichbar.",
      "imageUrl": "src/assets/news/2026-01-31-website-release.png"
    },
    {
      "visible": true,
      "date": "2026-01-24",
      "title": "Aboutme fertig",
      "text": "Nach diversen Fehltritten und Anpassungen und dem Umstieg auf googles Antigravity IDE ist nun die aboutme Seite fertig.",
      "imageUrl": "src/assets/news/2026-01-24-aboutme-page-fertig.png"
    },
    {
      "visible": true,
      "date": "2026-01-15",
      "title": "Blog Migration abgeschlossen",
      "text": "Nach Monaten harter Arbeit ist die Migration aller Blog Artikel abgeschlossen. Es wurden 40 von insgesamt 91 Artikel vom alten Wordpress basierten Blog übernommen. 51 Artikel wurden verworfen, was eine Übernahmequote von 44% bedeutet. Ein großes Learning hieraus ist das Verständnis, wie Artikel aufgebaut werden, welche Inhalte interessant sind, welche dauerhaft oder nur kurzfristig sind.",
      "imageUrl": "src/assets/news/2026-01-15-wordpress-blog-migration-complete.png"
    },
    {
      "visible": true,
      "date": "2025-12-30",
      "title": "Portfolio gelauncht",
      "text": "Eine Portfolio Seite wurde hinzugefügt, um meine Projekte und Arbeiten zu präsentieren. Diese Seite bietet einen Überblick über meine Fähigkeiten und Erfahrungen in verschiedenen Bereichen, einschließlich Webentwicklung, Design und mehr. Besucher können durch meine bisherigen Arbeiten stöbern und sich ein Bild von meinem Stil und meiner Herangehensweise machen.",
      "imageUrl": "src/assets/news/2025-12-30-portfolio-launched.png"
    },
    {
      "visible": true,
      "date": "2025-12-23",
      "title": "Neue Startseite gelauncht",
      "text": "Die neue Startseite meiner Webseite ist live. Sie wurde komplett überarbeitet, um eine bessere Benutzererfahrung zu bieten und die wichtigsten Inhalte hervorzuheben. Das Design ist modern und ansprechend, mit klaren Call-to-Actions und einer übersichtlichen Navigation.",
      "imageUrl": "src/assets/news/2025-12-23-new-homepage-launched.png"
    },
    {
      "visible": true,
      "date": "2025-11-13",
      "title": "Produktgalerie gelauncht",
      "text": "Die Produktgalerie meiner Webseite ist nun live. Hier präsentiere ich verschiedene Produkte, die ich entwickelt habe, inklusive detaillierter Beschreibungen und Bilder. Die Galerie ist so gestaltet, dass sie sowohl informativ als auch ansprechend ist, um Besuchern einen umfassenden Überblick über meine Arbeit zu bieten. Kien Mensch will heutzutage noch mit etsay arbeiten ;-).",
      "imageUrl": "src/assets/news/2025-11-13-product-gallery-launched.png"
    },
    {
      "visible": true,
      "date": "2025-08-23",
      "title": "Link redirect system mit affiliate support",
      "text": "Die erste vibe gecodete Komponenten ist fertig. Mit Hilfe von Claude habe ich ein Link-Redirect System entwickelt, welches es mir erlaubt, Links zu redirecten und gleichzeitig Affiliate-Parameter hinzuzufügen. Dies ermöglicht es mir, meine Webseite zu monetarisieren, ohne dass die User Experience darunter leidet.",
      "imageUrl": "src/assets/news/2025-08-23-link-redirect-system-launched.png"
    },
    {
      "visible": true,
      "date": "2025-08-14",
      "title": "Start des relaunch",
      "text": "Wordpress hat seinen Dienst getan. Mit dem heutigen Tag starte ich den Relaunch meiner persönlichen Webseite. Der Fokus liegt auf Performance, einheitliches Design, KI Unterstützung und Flexibilität. Technisch setze ich auf Astro, TailwindCSS und React.",
      "imageUrl": "src/assets/news/2025-08-14-start-des-relaunch.png"
    }
  ]
}
